Revit 2026 API

# BuiltInFailuresReshapeFromFacetsFailures Class

---

SystemObject Autodesk.Revit.DBBuiltInFailuresReshapeFromFacetsFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ReshapeFromFacetsFailures
```
```vb
Public NotInheritable Class ReshapeFromFacetsFailures
```
```cpp
public ref class ReshapeFromFacetsFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ReshapeFromFacetsFailures = class end
```

The BuiltInFailuresReshapeFromFacetsFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ReshapeFromFacetsFailed | Reshape from facets failed. [Description] |
|  | ReshapeFromFacetsFailedError | Reshape from facets failed. [Description] |

#### Reference

Autodesk.Revit.DB Namespace